//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
//void print(int x)
//{
//	if (x / 10000 > 0) {//取出万位数字
//			printf("%d ", x / 10000);
//	}
//	if (x % 10000 >= 1000) 
//	{//取余10000则可以取出低四位的数据，除以1000则得到千位的数字
//		printf("%d ", (x % 10000) / 1000);
//	}
//	if (x % 1000 >= 100) 
//	{//取余1000则可以取出低三位的数据，除以100则得到百位的数字
//		printf("%d ", (x % 1000) / 100);
//	}
//	if (x % 100 >= 10) 
//	{//取余100则可以取出低两位的数据，除以10则得到十位的数字
//		printf("%d ", (x % 100) / 10);
//	}
//	if (x % 10 >= 0) 
//	{//取余10则取出个位数字
//		printf("%d ", x % 10);
//	}
//}非递归
//递归方式
//void print(  int x)
//{
//	if (x < 10000 && x > 10) 
//	{
//		print(x / 10);
//	}
//	printf("%d ",x%10);
//}
//int main()
//{
//    int num;
//	scanf("%d", &num);
//	print(num);
//	return 0;
//}